Revit 2024 API
IndexTriangle Properties
The IndexTriangle type exposes the following members.
Properties
Name | Description
Index0
 The index of the triangle's first vertex.
Index1
 The index of the triangle's second vertex.
Index2
 The index of the triangle's third vertex.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from IndexPrimitive.)
See Also
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace